ChillyTan/CIMC-Repository/GD32F4例程代码(苹果派)/基础例程/附加实验/15.DbgMCU/App/LED/LED.c
/*********************************************************************************************************
* 模块名称：LED.c
* 摘    要：LED模块
* 当前版本：1.0.0
* 作    者：Leyutek(COPYRIGHT 2018 - 2022 Leyutek. All rights reserved.)
* 完成日期：2022年01月01日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "LED.h"
#include "gd32f470x_conf.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量定义
*********************************************************************************************************/
static unsigned short PRE;

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static  void  ConfigLEDGPIO(void);  //配置LED的GPIO

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：ConfigLEDGPIO
* 函数功能：配置LED的GPIO 
* 输入参数：void 
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：
*********************************************************************************************************/
static  void  ConfigLEDGPIO(void)
{
  //使能RCU相关时钟
  rcu_periph_clock_enable(RCU_GPIOB);  //使能GPIOB的时钟
  rcu_periph_clock_enable(RCU_GPIOI);  //使能GPIOI的时钟

  //配置LED1
  gpio_mode_set(GPIOB, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_5);         //上拉输出
  gpio_output_options_set(GPIOB, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_5); //推挽输出
  gpio_bit_set(GPIOB, GPIO_PIN_5);                                              //点亮LED1

  //配置LED2
  gpio_mode_set(GPIOI, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, GPIO_PIN_8);         //上拉输出
  gpio_output_options_set(GPIOI, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_8); //推挽输出
  gpio_bit_reset(GPIOI, GPIO_PIN_8);                                            //熄灭LED2
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：InitLED
* 函数功能：初始化LED模块
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：
*********************************************************************************************************/
void InitLED(void)
{
  ConfigLEDGPIO();  //配置LED的GPIO
}

/*********************************************************************************************************
* 函数名称：LEDFlicker
* 函数功能：LED闪烁函数
* 输入参数：cnt
* 输出参数：void
* 返 回 值：void
* 创建日期：2022年01月01日
* 注    意：LEDFlicker在Proc2msTask中调用，cnt为250时表示每500ms更改一次LED状态
*********************************************************************************************************/
void LEDFlicker(unsigned short cnt)
{
  static unsigned short s_iCnt;  //定义静态变量s_iCnt作为计数器
  
  s_iCnt++;                      //计数器的计数值加1
  
  if(s_iCnt >= cnt)              //计数器的计数值大于cnt
  {
    s_iCnt = 0;                  //重置计数器的计数值为0
	
		//LED1状态取反，实现LED1闪烁
    gpio_bit_write(GPIOB, GPIO_PIN_5, (bit_status)(1 - gpio_output_bit_get(GPIOB, GPIO_PIN_5)));

    //LED2状态取反，实现LED2闪烁
    gpio_bit_write(GPIOI, GPIO_PIN_8, (bit_status)(1 - gpio_output_bit_get(GPIOI, GPIO_PIN_8)));
  }
}

/*********************************************************************************************************
* 函数名称：PRESet
* 函数功能：设置LED闪烁周期
* 输入参数：pre
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：
*********************************************************************************************************/
void PRESet(unsigned short pre)
{
  PRE = pre;
}

/*********************************************************************************************************
* 函数名称：LEDToggle
* 函数功能：控制LED按照设置的周期闪烁
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2021年07月01日
* 注    意：LEDToggle在TIMER15_IRQHandler中调用，LED灯翻转周期为PRE*2 ms，
*********************************************************************************************************/
void LEDToggle(void)
{
  static unsigned short s_iPre;  //定义静态变量s_iCnt作为计数器
  
  s_iPre++;                      //计数器的计数值加1
  
  if(2*s_iPre >= PRE)              //计数器的计数值大于PRE
  { 
    s_iPre = 0;                  //重置计数器的计数值为0

    //LED1状态取反，实现LED1闪烁
    gpio_bit_write(GPIOB, GPIO_PIN_5, (bit_status)(1 - gpio_output_bit_get(GPIOB, GPIO_PIN_5)));

    //LED2状态取反，实现LED2闪烁
    gpio_bit_write(GPIOI, GPIO_PIN_8, (bit_status)(1 - gpio_output_bit_get(GPIOI, GPIO_PIN_8)));
  }
}

